src/InformationRegisters/APDEX_Настройки/APDEX_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>APDEX_Настройки</name>
  <resources>
    <name>APDEX_ОтключитьЗамер</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>APDEX_МинимальноеВремяЗамера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ИдентификаторБазыAPDEX</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ИмяВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ПользовательВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ПарольВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ФормироватьПочтовыеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>APDEX_ПутьКФайламПочтовыхВложений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ЭлектроннаяПочтаСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_СистемнаяУчетнаяЗаписьПочтыСервиса</name>
    <type>
      <types>CatalogRef.APDEX_УчетныеЗаписиЭлектроннойПочтыСервиса</types>
    </type>
  </resources>
  <resources>
    <name>APDEX_СпособЗаписиЗамеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ИспользуетсяОфлайнМониторинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>APDEX_НастройкаОфлайнМониторинга</name>
    <type>
      <types>CatalogRef.APDEX_НастройкиОфлайнМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>APDEX_ИмяИсследуемойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ИмяВебСервисаРезерв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ИмяИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>APDEX_ПорогДляСтарыхДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Измерение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/APDEX_Настройки/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура APDEX_ФормироватьПочтовыеФайлыПриИзменении(Элемент)
	УстановитьВидимостьПочтовыхНастроек();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПочтовыхНастроек()
	
	ФлагВидимости = Запись.APDEX_ФормироватьПочтовыеФайлы;
	
	Элементы.APDEX_ПутьКФайламПочтовыхВложений.Видимость = ФлагВидимости;
	Элементы.APDEX_ЭлектроннаяПочтаСервиса.Видимость = ФлагВидимости;
	Элементы.APDEX_СистемнаяУчетнаяЗаписьПочтыСервиса.Видимость = ФлагВидимости;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьОфлайнМониторинга()
	
	ФлагВидимости = Запись.APDEX_ИспользуетсяОфлайнМониторинг;
	
	Элементы.APDEX_НастройкаОфлайнМониторинга.Видимость = ФлагВидимости;
	Элементы.ГруппаСпособаЗаписиЗамеров.Видимость = НЕ ФлагВидимости;
	Элементы.APDEX_ИмяИсследуемойБазы.Видимость = ФлагВидимости; 

	Если ФлагВидимости Тогда
		Запись.APDEX_СпособЗаписиЗамеров = 2;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьПочтовыхНастроек();
    УстановитьВидимостьОфлайнМониторинга();
КонецПроцедуры

&НаКлиенте
Процедура APDEX_ИспользуетсяОфлайнМониторингПриИзменении(Элемент)
	УстановитьВидимостьОфлайнМониторинга();
КонецПроцедуры
